fio-benchmark/report-fio-rand-read4k_2024-09-20T175740-0500.out
Rand-Read-4k: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.33
Starting 32 processes
Rand-Read-4k: Laying out IO file (1 file / 1024MiB)

Rand-Read-4k: (groupid=0, jobs=32): err= 0: pid=11230: Fri Sep 20 17:58:51 2024
  read: IOPS=6982, BW=27.3MiB/s (28.6MB/s)(1637MiB/60009msec)
    slat (usec): min=14, max=84505, avg=79.81, stdev=513.40
    clat (usec): min=3, max=194910, avg=4480.54, stdev=4618.97
     lat (usec): min=63, max=194933, avg=4560.35, stdev=4657.06
    clat percentiles (usec):
     |  1.00th=[   502],  5.00th=[  1123], 10.00th=[  1549], 20.00th=[  2147],
     | 30.00th=[  2671], 40.00th=[  3130], 50.00th=[  3654], 60.00th=[  4228],
     | 70.00th=[  4883], 80.00th=[  5800], 90.00th=[  7373], 95.00th=[  9503],
     | 99.00th=[ 21890], 99.50th=[ 31327], 99.90th=[ 56886], 99.95th=[ 71828],
     | 99.99th=[116917]
   bw (  KiB/s): min= 6778, max=66298, per=100.00%, avg=27976.56, stdev=332.10, samples=3808
   iops        : min= 1678, max=16561, avg=6986.93, stdev=83.09, samples=3808
  lat (usec)   : 4=0.01%, 10=0.08%, 20=0.01%, 50=0.01%, 100=0.03%
  lat (usec)   : 250=0.18%, 500=0.68%, 750=1.10%, 1000=1.75%
  lat (msec)   : 2=13.45%, 4=39.25%, 10=39.06%, 20=3.27%, 50=0.99%
  lat (msec)   : 100=0.13%, 250=0.02%
  cpu          : usr=0.87%, sys=1.67%, ctx=444385, majf=0, minf=374
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=418986,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=27.3MiB/s (28.6MB/s), 27.3MiB/s-27.3MiB/s (28.6MB/s-28.6MB/s), io=1637MiB (1716MB), run=60009-60009msec