fio-benchmark/report-fio-seq-read1g_2024-09-20T180001-0500.out
Seq-Read-1G: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=32
fio-3.33
Starting 1 process
Seq-Read-1G: Laying out IO file (1 file / 1024MiB)

Seq-Read-1G: (groupid=0, jobs=1): err= 0: pid=11295: Fri Sep 20 18:00:12 2024
  read: IOPS=885, BW=885MiB/s (928MB/s)(2048MiB/2313msec)
    slat (usec): min=37, max=16560, avg=313.42, stdev=1041.00
    clat (msec): min=2, max=493, avg=34.62, stdev=45.64
     lat (msec): min=3, max=493, avg=34.93, stdev=45.69
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   10], 10.00th=[   12], 20.00th=[   15],
     | 30.00th=[   17], 40.00th=[   19], 50.00th=[   22], 60.00th=[   24],
     | 70.00th=[   29], 80.00th=[   36], 90.00th=[   79], 95.00th=[  122],
     | 99.00th=[  232], 99.50th=[  305], 99.90th=[  485], 99.95th=[  493],
     | 99.99th=[  493]
   bw (  KiB/s): min=218698, max=1476233, per=86.98%, avg=788632.25, stdev=619799.88, samples=4
   iops        : min=  213, max= 1441, avg=769.75, stdev=605.31, samples=4
  lat (msec)   : 4=0.20%, 10=4.93%, 20=39.94%, 50=41.99%, 100=6.25%
  lat (msec)   : 250=5.86%, 500=0.83%
  cpu          : usr=2.55%, sys=20.20%, ctx=1255, majf=0, minf=8203
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=0.8%, 16=1.6%, 32=97.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=2048,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=885MiB/s (928MB/s), 885MiB/s-885MiB/s (928MB/s-928MB/s), io=2048MiB (2147MB), run=2313-2313msec